# Brewfile

brew "ansible"
brew "bash-completion"
brew "bash-git-prompt"
brew "bison"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "docker"
brew "docker-compose"
brew "fzf"
brew "gcc"
brew "git"
brew "go"
brew "gradle"
brew "icdiff"
brew "jq"
brew "libevent"
brew "make"
brew "mosh"
brew "ncurses"
brew "openjdk"
brew "openjdk@11"
brew "parallel"
brew "ruby"
brew "tig"
brew "tmux"
brew "tree"
brew "yq"

# k8s
brew "derailed/popeye/popeye"
brew "dty1er/tap/kubecolor"
brew "helm"
brew "k9s"
brew "kube-ps1"
brew "kubernetes-cli"
brew "rke"
brew "stern"

cask "caffeine"
cask "font-hack-nerd-font"
cask "font-hack-nerd-font-mono"
cask "meld"
cask "virtualbox"
cask "docker"
